//-----------------------------------------------------------------------------
// File : rsPassBuilder.cpp
// Desc : Pass Builder.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------


namespace rs {

///////////////////////////////////////////////////////////////////////////////
// PassBuilder class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
PassBuilder::PassBuilder(PassGraph* value)
: m_pPassGraph(value)
{
}

//-----------------------------------------------------------------------------
//      リソースを読み取ります.
//-----------------------------------------------------------------------------
ResourceHandle PassBuilder::Read(const ResourceHandle& handle, uint32_t flag)
{
    
    return handle;
}

//-----------------------------------------------------------------------------
//      リソースを書き込みます.
//-----------------------------------------------------------------------------
ResourceHandle PassBuilder::Write(const ResourceHandle& handle, uint32_t flag)
{
    return handle;
}

//-----------------------------------------------------------------------------
//      リソースを生成します.
//-----------------------------------------------------------------------------
ResourceHandle PassBuilder::Create(const PassTextureDesc& desc)
{
    uint32_t index = 0;

    return ResourceHandle(index);
}

//-----------------------------------------------------------------------------
//      リソースを取り込みます.
//-----------------------------------------------------------------------------
ResourceHandle PassBuilder::Import(const PassImportTextureDesc& desc)
{
    uint32_t index = 0;

    return ResourceHandle(index);
}


} // namespace rs